dizzy % vis
vis release 1.4 (compiled 19-Apr-01 at 7:01 AM)
Sourcing .visrc for Fabio. 
vis> rlmv BBypassSpec.mv 
Warning: Some variables are unused in model BBypassSpec.
Warning: Some variables are unused in model compares.
Warning: Some variables are unused in model MUX4_9.
Warning: Some variables are unused in model MUX3_10.
vis> flt
vis> set hd_frontier_approx_threshold 3500
vis> so
vis> dvo -e sift -v 1
Dynamic variable ordering is enabled with method sift.
vis> part inout
BDD reordering with sifting: from 4001 to ... 3040 nodes in 0.3 sec
BDD reordering with sifting: from 6081 to ... 4100 nodes in 0.31 sec
vis> rch -v 1 -s 1 -g BBypassSpec.hint2 
BDD reordering with sifting: from 8201 to ... 4189 nodes in 1.38 sec
BDD reordering with sifting: from 8379 to ... 4169 nodes in 1.45 sec
BDD reordering with sifting: from 8339 to ... 4900 nodes in 1.54 sec
BDD reordering with sifting: from 9801 to ... 9292 nodes in 1.69 sec
BDD reordering with sifting: from 18585 to ... 18198 nodes in 2.76 sec
BDD reordering with sifting: from 36397 to ... 36089 nodes in 5.38 sec
BDD reordering with sifting: from 72179 to ... 72040 nodes in 12.86 sec
BDD reordering with sifting: from 144081 to ... 143727 nodes in 27.74 sec
IMG Info: minimized fwd relation [3954 | 31 => 4691] with 107 components
GS: Instantiating  hint number 1
BFS step = 0    |states| =        1     Bdd size =      108
BFS step = 1    |states| =      385     Bdd size =      183
BFS step = 2    |states| =     1276     Bdd size =      268
BFS step = 3    |states| =    60028     Bdd size =      504
BFS step = 4    |states| =   111680     Bdd size =      712
BFS step = 5    |states| =   570240     Bdd size =      798
IMG Info: minimized fwd relation [3954 | 25 => 3857] with 107 components
GS: Instantiating  hint number 2
BFS step = 7    |states| = 3.86035e+06  Bdd size =      857
BFS step = 8    |states| = 9.85276e+07  Bdd size =     2473
BFS step = 9    |states| = 7.05063e+08  Bdd size =     5483
BFS step = 10   |states| = 1.35163e+10  Bdd size =    20724
BFS step = 11   |states| = 8.74224e+10  Bdd size =    50142
BDD reordering with sifting: from 287455 to ... 56802 nodes in 39.26 sec
BFS step = 12   |states| = 1.6235e+12   Bdd size =    17558
BDD reordering with sifting: from 113601 to ... 45846 nodes in 29.11 sec
IMG Info: minimized fwd relation [8967 | 19 => 14854] with 107 components
GS: Instantiating  hint number 3
BDD reordering with sifting: from 91691 to ... 50958 nodes in 25.51 sec
BDD reordering with sifting: from 101915 to ... 67098 nodes in 40.85 sec
BDD reordering with sifting: from 134196 to ... 74611 nodes in 57.04 sec
BFS step = 14   |states| = 6.31801e+12  Bdd size =    26761
BDD reordering with sifting: from 148963 to ... 67385 nodes in 44.16 sec
BDD reordering with sifting: from 134748 to ... 70268 nodes in 45.14 sec
BDD reordering with sifting: from 140536 to ... 102363 nodes in 59.25 sec
BDD reordering with sifting: from 204727 to ... 195844 nodes in 130.48 sec
BFS step = 15   |states| = 2.12135e+14  Bdd size =    34159
BDD reordering with sifting: from 391534 to ... 283959 nodes in 273.98 sec
BDD reordering with sifting: from 567913 to ... 558426 nodes in 694.13 sec
IMG Info: minimized fwd relation [4470 | 0 => 4470] with 107 components
GS: Restoring original transition relation
BFS step = 17   |states| = 5.49169e+16  Bdd size =    48083
BDD reordering with sifting: from 1116852 to ... 149495 nodes in 364.07 sec
BFS step = 18   |states| = 9.38452e+18  Bdd size =   132841
BDD reordering with sifting: from 1116510 to ... 643079 nodes in 673.73 sec
BDD reordering with sifting: from 1285843 to ... 1095178 nodes in 1527.77 sec
BDD reordering with sifting: from 2190368 to ... 2173649 nodes in 4385.72 sec
BFS step = 19   |states| = 1.21919e+19  Bdd size =   244675
BDD reordering with sifting: from 4347298 to ... 1248595 nodes in 1988.87 sec
BFS step = 20   |states| = 4.82462e+20  Bdd size =   367663
BDD reordering with sifting: from 4347318 to ... 3607300 nodes in 8015.29 sec
BDD reordering with sifting: from 7214630 to ... 6718280 nodes in 23615.1 sec
BFS step = 21   |states| = 6.05753e+20  Bdd size =  1160995
BDD reordering with sifting: from 13436560 to ... 3502312 nodes in 9384.17 sec
BFS step = 22   |states| = 1.05384e+21  Bdd size =   233879
** rch info: Computing reachable states using the iwls95 image
computation method.
Printing Information about Image method: IWLS95
        Threshold Value of Bdd Size For Creating Clusters = 5000
                (Use "set image_cluster_size value" to set this to desired value)
        Verbosity = 0
                (Use "set image_verbosity value" to set this to desired value)
        W1 =  6 W2 = 1 W3 = 1 W4 = 2
                (Use "set image_W? value" to set these to desired values)
Shared size of transition relation for forward image computation is      24246 BDD nodes (6    components)
********************************
Reachability analysis results:
computation depth =         23
reachable states =  1.05384e+21
BDD size =              233879
analysis time =        52629.9
reachability analysis =   complete
vis> wo BBypassSpec.ord 
vis> pbs
**** CUDD modifiable parameters ****
Hard limit for cache size: 14745600
Cache hit threshold for resizing: 30%
Garbage collection enabled: yes
Limit for fast unique table growth: 8847360
Maximum number of variables sifted per reordering: 1000
Maximum number of variable swaps per reordering: 2000000
Maximum growth while sifting a variable: 1.2
Dynamic reordering of BDDs enabled: yes
Default BDD reordering method: 4
Dynamic reordering of ZDDs enabled: no
Default ZDD reordering method: 4
Realignment of ZDDs to BDDs enabled: no
Realignment of BDDs to ZDDs enabled: no
Dead nodes counted in triggering reordering: no
Group checking criterion: 7
Recombination threshold: 0
Symmetry violation threshold: 0
Arc violation threshold: 0
GA population size: 0
Number of crossovers for GA: 0
Next reordering threshold: 13436584
**** CUDD non-modifiable parameters ****
Memory in use: 573444276
Peak number of nodes: 24317468
Peak number of live nodes: 13436564
Number of BDD variables: 266
Number of ZDD variables: 0
Number of cache entries: 8388608
Number of cache look-ups: 283626075
Number of cache hits: 103719906
Number of cache insertions: 180072276
Number of cache collisions: 111262136
Number of cache deletions: 65552191
Cache used slots = 100.00% (expected 99.82%)
Soft limit for cache size: 14745600
Number of buckets in unique table: 10341376
Used buckets in unique table: 35.63% (expected 35.60%)
Number of BDD and ADD nodes: 4908755
Number of ZDD nodes: 0
Number of dead BDD and ADD nodes: 4422852
Number of dead ZDD nodes: 0
Total number of nodes allocated: 126674637
Total number of nodes reclaimed: 261018566
Garbage collections so far: 40
Time for garbage collection: 270.50 sec
Reorderings so far: 29
Time for reordering: 51449.01 sec

More detailed information about the semantics and values of these parameters
can be found in the documentation about the CU Decision Diagram Package.
vis> time
elapse: 52633.7 seconds, total: 52633.7 seconds
vis> q -s
